
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтборСтроки = СтруктураОтбораПоСсылке(ВыбраннаяСтрока);
	НайденныеСтроки = ЭтаФорма.ВладелецФормы.Объект.ПодписанныеРегламентныеЗадания.НайтиСтроки(ОтборСтроки);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ЭтаФорма.ВладелецФормы.Объект.ПодписанныеРегламентныеЗадания.Добавить();
		НоваяСтрока.РегламентноеЗадание = ОтборСтроки.РегламентноеЗадание;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтруктураОтбораПоСсылке(ВыбраннаяСтрока)
	ОтборСтроки = Новый Структура;
	ОтборСтроки.Вставить("РегламентноеЗадание", ВыбраннаяСтрока.Ссылка);
	Возврат ОтборСтроки;
КонецФункции