#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщиеПараметрыДобавляемыхБаз = Параметры.ПараметрыДобавляемыхБаз; 
	
	Для Каждого Параметр Из Параметры.ПараметрыДобавляемыхБаз Цикл 		
		СтрокаОбщихПараметров = ОбщиеПараметры.Добавить();
		СтрокаОбщихПараметров.Имя = Параметр.Ключ;
		СтрокаОбщихПараметров.Значение = Параметр.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого База Из ДобавляемыеБазы Цикл
		
		ПараметрыДобавляемойБазы = Новый Структура;
		ПараметрыДобавляемойБазы.Вставить("Имя", База.Имя);
		ПараметрыДобавляемойБазы.Вставить("Описание", База.Описание);
		ПараметрыДобавляемойБазы.Вставить("ИмяБазыНаСервереСУБД", База.ИмяБазыНаСервереСУБД);
		ПараметрыДобавляемойБазы.Вставить("БлокировкаРегламентныхЗаданийВключена", База.БлокировкаРегламентныхЗаданийВключена);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыДобавляемойБазы, ОбщиеПараметрыДобавляемыхБаз);
		
		Результат.Добавить(ПараметрыДобавляемойБазы);
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти