
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ДопустимыеЗначения(Параметры.Отбор, Параметры.СтрокаПоиска);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;

	//ДанныеВыбора = ДопустимыеЗначения(Параметры.Отбор);
	//Параметры.Отбор.Очистить();
	//Параметры.Отбор.Вставить("Ссылка", ДанныеВыбора);
	////Jira  Nikolay Ivanov 22.08.2025 ++
	////Ограничение по Пд
	//Если ВидФормы = "ФормаВыбора" Тогда 
	//	ВыбраннаяФорма = "Перечисление.ВидыОперацийПКО.ФормаВыбора";
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;
КонецПроцедуры

Функция ДопустимыеЗначения(Отбор = Неопределено, Знач СтрокаПоиска = Неопределено) Экспорт
	ДопустимыеЗначения = Новый СписокЗначений;

	//// Значения могут быть запрещены для выбора профилем полномочий пользователя
	//РазрешенныеЗначения = УправлениеДоступом.РазрешенныеЗначенияДляДинамическогоСписка(
	//"Документ.ПриходныйКассовыйОрдер",
	//Тип("ПеречислениеСсылка.ВидыОперацийПКО"));

	//// Получим отобранный и упорядоченный перечень значений с представлениями
	//// Сразу исключаем РасчетыПоКредитамИЗаймам, так как он не используется в новых документах
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ВидыОперацийПКО.Ссылка КАК Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(ВидыОперацийПКО.Ссылка) КАК Представление,
	//|	ВидыОперацийПКО.Порядок КАК Порядок
	//|ИЗ
	//|	Перечисление.ВидыОперацийПКО КАК ВидыОперацийПКО
	//|ГДЕ
	//|	ВидыОперацийПКО.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РасчетыПоКредитамИЗаймам)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок";

	//ТекстыОтбора = Новый Массив;

	//// Исключаем неразрешенные значения
	//Если РазрешенныеЗначения <> Неопределено Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка В(&РазрешенныеЗначения)");
	//	Запрос.УстановитьПараметр("РазрешенныеЗначения", РазрешенныеЗначения);
	//КонецЕсли;

	//ТипОтбора = ТипЗнч(Отбор);

	//// Исключаем ссылки, переданные в отборе
	//Если ТипОтбора = Тип("ПеречислениеСсылка.ВидыОперацийПКО") Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка = &Отбор");
	//	Запрос.УстановитьПараметр("Отбор", Отбор);
	//ИначеЕсли ТипОтбора = Тип("ФиксированныйМассив") Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка В(&Отбор)");
	//	Запрос.УстановитьПараметр("Отбор", Отбор);
	//КонецЕсли;

	//Если Не ПолучитьФункциональнуюОпцию("ВестиУчетИндивидуальногоПредпринимателя") Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка <> Значение(Перечисление.ВидыОперацийПКО.ЛичныеСредстваПредпринимателя)");
	//КонецЕсли;

	//Если ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком() Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка <> Значение(Перечисление.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица)");
	//КонецЕсли;

	//Если Не ПолучитьФункциональнуюОпцию("ВестиУчетЮридическогоЛица") Тогда
	//	ТекстыОтбора.Добавить("ВидыОперацийПКО.Ссылка <> Значение(Перечисление.ВидыОперацийПКО.ВзносВУставныйКапитал)");
	//КонецЕсли;

	//Если ЗначениеЗаполнено(ТекстыОтбора) Тогда

	//	СхемаЗапроса = Новый СхемаЗапроса;
	//	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);

	//	ТекстОтбора = СтрСоединить(ТекстыОтбора, Символы.ПС + " И ");
	//	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить(ТекстОтбора);

	//	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();

	//КонецЕсли;

	//// Готовим поиск по наименованию
	//ОтборПоПредставлению = (ТипЗнч(СтрокаПоиска) = Тип("Строка") И Не ПустаяСтрока(СтрокаПоиска));
	//Если ОтборПоПредставлению Тогда
	//	СтрокаПоиска = НРег(СтрокаПоиска); // поиск регистронезависимый
	//КонецЕсли;

	//СведенияОбОрганизации = Новый Структура; // может использоваться для проверки допустимости отдельных видов операций

	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл

	//	Если ОтборПоПредставлению
	//		И СтрНайти(НРег(Выборка.Представление), СтрокаПоиска) <> 1 Тогда
	//		Продолжить;
	//	КонецЕсли;

	//	// Исключаем неподходящие к контексту
	//	Если Выборка.Ссылка = Перечисления.ВидыОперацийПКО.ЛичныеСредстваПредпринимателя Тогда
	//		Если СведениеОбОрганизации("ЭтоЮрЛицо", СведенияОбОрганизации, Отбор) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;

	//	Если Выборка.Ссылка = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
	//		Если Не СведениеОбОрганизации("ЕстьБанковскиеСчета", СведенияОбОрганизации, Отбор) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;

	//	Если Выборка.Ссылка = Перечисления.ВидыОперацийПКО.ВозвратЗаймаРаботником Тогда
	//		Если Не УчетЗарплаты.ИспользуетсяПодсистемаУчетаЗарплатыИКадров()
	//			Или Не СведениеОбОрганизации("ЕстьРаботники", СведенияОбОрганизации, Отбор) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;

	//	Если Выборка.Ссылка = Перечисления.ВидыОперацийПКО.ВзносВУставныйКапитал Тогда
	//		Если Не СведениеОбОрганизации("ЭтоЮрЛицо", СведенияОбОрганизации, Отбор) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;		

	//	// Остальные - допустимые
	//	ДопустимыеЗначения.Добавить(Выборка.Ссылка, Выборка.Представление);

	//КонецЦикла;
	////Jira  Nikolay Ivanov 22.08.2025 ++   
	//Если (//ПараметрыСеанса.ОМ_ЗапретПД Или  
	//	ПараметрыСеанса.ОМ_ЗапретПД_БанкИКасса)  Тогда 
	//	Массив = ОМ_ОбщегоНазначения.ПолучитьМассивПКО();
	//	Для Каждого Эл из Массив Цикл 
	//		Найден = ДопустимыеЗначения.НайтиПоЗначению(Эл); 
	//		Если Найден = Неопределено Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		ДопустимыеЗначения.Удалить(Найден);
	//	КонецЦикла;
	//	
	//КонецЕсли; 
	//--    
	Возврат ДопустимыеЗначения;

КонецФункции
