&НаСервере
Процедура ОчиститьСтатистику()
	
	РегистрыСведений.Статистика.СоздатьНаборЗаписей().Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанные(Команда)
	
	Если Вопрос("Очистить всю статистику?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
		ОчиститьСтатистику();
		Оповестить("СтатистикаОбновлена");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СтатистикаОбновлена" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере()
	
	Возврат МониторингЛицензий.ПолучитьДанные(Сервер);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьТекущиеДанные(Команда)
	
	Если ПолучитьДанныеНаСервере() Тогда
		Сообщить("Данные об используемых лицензиях успешно получены!", СтатусСообщения.Информация);
		Оповестить("СтатистикаОбновлена");
	Иначе
		Сообщить("Не удалось получить данные об используемых лицензиях (см. журнал регистрации)!", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры
