#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Узел, ОбъектМетаданных, Идентификатор, ИдентификаторПриемника) Экспорт
	
	Менеджер = РегистрыСведений.ПереданныеМастерданные.СоздатьМенеджерЗаписи();
	
	Менеджер.Узел = Узел;
	Менеджер.ОбъектМетаданных = ОбъектМетаданных;
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.ИдентификаторПриемника = ИдентификаторПриемника;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
