#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ЗаполнитьПинкоды() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пинкод.КомплектПоставки.Ссылка КАК Ссылка,
	|	Пинкод.СтатусПинкода КАК СтатусПинкода,
	|	Пинкод.Наименование КАК Пинкод
	|ИЗ
	|	Справочник.Пинкод КАК Пинкод
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаКомплект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКомплект.Следующий() Цикл
		КомплектПоставки = ВыборкаКомплект.Ссылка.ПолучитьОбъект(); 
		КомплектПоставки.Пинкоды.Очистить();
		Выборка = ВыборкаКомплект.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = КомплектПоставки.Пинкоды.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
		КомплектПоставки.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
