
&НаСервере
Процедура ОтправитьОбработкуНаСервере()
	
	Данные =СформироватьСообщениеСерверу();
	
	//ДанныеЗапроса = Новый Структура();   
	//ДанныеЗапроса.Вставить("ОбъектВХранилище",Данные);
	//ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
	//ДанныеЗапроса.Вставить("Поля",Поля);
	
	WSИмяБазы = "HRM-Bgr";
	ВыборкаHTTP = "ОборотыHTTP";   
	ПутьНаСервере = "";
	Если Не ЗначениеЗаполнено(ПутьНаСервере) Тогда
		Если ВыборкаHTTP = "Объекты" Тогда
			ПутьНаСервере = WSИмяБазы + "/hs/sverka/V1/Объекты";
		ИначеЕсли ВыборкаHTTP = "ОборотыHTTP" Тогда
			ПутьНаСервере = WSИмяБазы + "/hs/ardp/V1/Обороты";	
		ИначеЕсли ВыборкаHTTP = "ВыборкаСоответствияHTTP" Тогда
			ПутьНаСервере = WSИмяБазы + "/hs/sverka/V1/ВыборкаСоответствия";	
		ИначеЕсли ВыборкаHTTP = "ВыборкаОбъекНеНайденHTTP" Тогда	
			ПутьНаСервере = WSИмяБазы +"/hs/sverka/V1/ВыборкаОбъекНеНайден";//ВыборкаОбъекНеНайден	  ObjectNoFound  
		ИначеЕсли ВыборкаHTTP = "ВыборкаОтправкаКонтроль" Тогда   
			ПутьНаСервере = WSИмяБазы +"/hs/sverka/V1/ВыборкаОтправкаКонтроль";	
		КонецЕсли;
		
	КонецЕсли;
	
	Соединение = ПолучитьПодключениеHTTPСервер();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");//"Content-Type","text/html; charset=utf-8");
	
	Запрос = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	//Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   //"UTF-8"
	Запрос.УстановитьТелоИзДвоичныхДанных(Данные);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);//ВызватьHTTPМетод("GET", Запрос);//;
	Если Ответ.КодСостояния = 200 Тогда
		
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Попытка
			ДанныеОтвета = unJSON(ТекстОтвета);
		Исключение
			ТекстСообщения = "Ошибка получения структуры из json. Причина: " + ОписаниеОшибки();
			Сообщить(ТекстСообщения);
			//Возврат Неопределено;
		КонецПопытки;
		
		//Возврат ДанныеОтвета;
		
	ИначеЕсли Ответ.КодСостояния = 302 или Ответ.КодСостояния = 301 Тогда // или 301
		НовыйАдрес = Ответ.Заголовки.Получить("Location"); // тут конечно можно добавить проверку на заполненность
	Иначе
		ТекстСообщения = "Не удалось выполнить запрос веб-сервиса. Код ответа: " + Ответ.КодСостояния;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		//Возврат Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция JSON(Данные, СОтступами = Истина) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция unJSON(JSONСтрока) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл();
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Функция  СформироватьСообщениеСерверу()

	ПолноеИмяФайла_ДвоичныеДанные = "\\fsrv01\GLOBAL\\Repository1C\Obrabotki\ЗУП\Печатные формы\Шаблон ТД.epf";
	
	 ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла_ДвоичныеДанные);
	 Возврат ДвоичныеДанные;
	 //Возврат Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	
КонецФункции

&НаСервере
Функция ПолучитьПодключениеHTTPСервер()  Экспорт  
	//Если  НЕ ЗначениеЗаполнено(WSИмяСервера) Тогда
		WSИмяСервера		=  "172.20.0.14"; 
		СервернаяБазаДанных = WSИмяСервера;
	//КонецЕсли;
	//Если  НЕ ЗначениеЗаполнено(WSИмяПользователя) Тогда
		WSИмяПользователя 	= "Rinat Galimov"; 
		Логин  = WSИмяПользователя;
	//КонецЕсли;
	//Если  НЕ ЗначениеЗаполнено(WSПароль) Тогда
		WSПароль 			= "fE4to5ca!@#$%";
		Пароль = WSПароль;
	//КонецЕсли;	

	Если Не ЗначениеЗаполнено(WSИмяСервера) Тогда
		ТекстСообщения = "Не определены настройки подключения к веб-сервису";
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли; 
	Попытка
		//Если SSL Тогда
		//	SSL1 = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);    
		//	Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,100,SSL1,);
		//Иначе 
			Соединение = Новый HTTPСоединение(WSИмяСервера,, WSИмяПользователя, WSПароль,,,,);	
		//КонецЕсли;
	Исключение
		ТекстСообщения = "Ошибка получения http соединения с базой. Причина: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьОбработку(Команда)
	ОтправитьОбработкуНаСервере();
КонецПроцедуры
