#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет сообщение в очередь.
//
// Параметры:
//   Узел - ПланОбменаСсылка.ПередачаМастерданных - узел интегрированной системы.
//   ДвоичныеДанныеСообщения - ДвоичныеДанные - данные сообщения.
//   Идентификатор - УникальныйИдентификатор - идентификатор сообщения;
//
Процедура ДобавитьСообщение(Узел, ДвоичныеДанныеСообщения, Идентификатор = Неопределено, ОбъектМетаданных = Неопределено) Экспорт
	
	Менеджер = РегистрыСведений.СообщенияПередачиМастерданных.СоздатьМенеджерЗаписи();
	
	Менеджер.Узел = Узел;
	Менеджер.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Менеджер.Данные = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	Менеджер.ОбъектМетаданных = ОбъектМетаданных;
	
	Если Идентификатор = Неопределено Тогда
		Менеджер.Идентификатор = Новый УникальныйИдентификатор();
	Иначе
		Менеджер.Идентификатор = Идентификатор;
	КонецЕсли;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
