#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрыЗапросаСтрокой) Тогда
		Попытка
			МассивФильтров = ПрочитатьЗначениеJSON(СтрЗаменить(Параметры.ПараметрыЗапросаСтрокой, "Filters=", "")); 
			Для Каждого Стр Из МассивФильтров Цикл
				ЗаполнитьЗначенияСвойств(Фильтры.Добавить(), Стр); 
			КонецЦикла;
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось преобразовать строку параметров к фильтрам. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого Фильтр Из Фильтры Цикл	
		Результат.Добавить(Новый Структура("Name,Type,Value", Фильтр.Name, Фильтр.Type, Фильтр.Value));		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти