Функция СоздатьПользователей(МассивИмен,ВозвращатьСозданныех = ЛОжь) Экспорт
	Ответ = Новый Структура("Ошибка, ОписаниеОшибки, Результат", Ложь, "", Неопределено);
	
	ВремМассив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИмен);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиИБ.Ссылка КАК Ссылка,
	               |	ПользователиИБ.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ПользователиИБ КАК ПользователиИБ
	               |ГДЕ
	               |	ПользователиИБ.Наименование В(&Наименование)";
	Запрос.УстановитьПараметр("Наименование", ВремМассив);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Индексы.Добавить("Наименование");
	
	Отбор = Новый Структура("Наименование");
	
	Массив 		= Новый Массив;
	Созданные 	= Новый Соответствие;
	
	Для Каждого Эл Из ВремМассив Цикл 
		Отбор.Наименование = Эл;
		Создан = Истина;
		Найдено = ТЗ.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(Найдено) Тогда 
			Ссылка = Найдено[0].Ссылка;
		Иначе 
			
			СпрО = Справочники.ПользователиИБ.СоздатьЭлемент();
			СпрО.Наименование = Эл;
			Попытка  
				СпрО.Записать(); 
				Ссылка = СпрО.Ссылка;
			Исключение
				Массив.Добавить(Эл + ": " + ОписаниеОшибки());
				Создан = Ложь;
			КонецПопытки;            
		КонецЕсли;
		
		Если ВозвращатьСозданныех И Создан Тогда 
			Созданные.Вставить(Эл, Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Массив) Тогда 
		Ответ.Ошибка = Истина; 
		Массив.Вставить(0,"Не удалось создать:");
		Ответ.ОписаниеОшибки = СтрСоединить(Массив, Символы.ПС);
	КонецЕсли;
	
	Если ВозвращатьСозданныех Тогда 
		Ответ.Результат = Созданные;
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции
