
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиИБ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПользователиИБ КАК ПользователиИБ
	               |ГДЕ
	               |	ПользователиИБ.Наименование = &Наименование
	               |	И ПользователиИБ.Ссылка <> &Ссылка"; 
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
