#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьМастерданные(Источник, ОбъектМетаданных, РеквизитыОбъектаМастерданных) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Источник = Источник;
	МенеджерЗаписи.ОбъектМетаданных = ОбъектМетаданных;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РеквизитыОбъектаМастерданных);
	МенеджерЗаписи.Записать(); 	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
