
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Не Данные.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Родитель.Наименование + " || " + Данные.Наименование;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля = Новый Массив;
	Поля.Добавить("ВебСервис");	
	Поля.Добавить("Наименование");	
	Поля.Добавить("Родитель");
	Поля.Добавить("ЭтоГруппа");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
