#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСообщение(Знач Топик, Сообщение) Экспорт
	
	СообщениеКафки = СоздатьМенеджерЗаписи();   
	СообщениеКафки.Топик = Топик;  
	СообщениеКафки.НомерСообщения = Сообщение.offset;
	СообщениеКафки.Идентификатор = Сообщение.key;
	СообщениеКафки.ТекстСообщения = ЗаписатьЗначениеJSON(Сообщение.value);
	СообщениеКафки.ВремяЗаписи = ТекущаяДата();
	СообщениеКафки.Записать(); 	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
