
Процедура ОбработкаПисем() Экспорт
	ТЗ = РегистрыСведений.ЗаявкиНаСогласовании.ПолучитьЗаявкиНаСогласовании();
	Если ТЗ.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаСогласовании.Заявка КАК Заявка,
	               |	ЗаявкиНаСогласовании.Письмо КАК Письмо,
	               |	""%"" + ЗаявкиНаСогласовании.Гуид + ""%"" КАК Гуид
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ЗаявкиНаСогласовании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Заявка КАК Заявка,
	               |	ЭлектронноеПисьмоИсходящее.Тема КАК Тема,
	               |	ЭлектронноеПисьмоИсходящее.Текст КАК Текст,
	               |	ЭлектронноеПисьмоИсходящее.ТекстHTML КАК ТекстHTML,
	               |	ЭлектронноеПисьмоИсходящее.ТипТекста КАК ТипТекста,
	               |	ЭлектронноеПисьмоИсходящее.Ссылка КАК ВхПисьмо,
	               |	0 КАК Вид
	               |ПОМЕСТИТЬ Сбор
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО ВТ.Письмо = ЭлектронноеПисьмоИсходящее.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ.Заявка,
	               |	ЭлектронноеПисьмоИсходящее.Тема,
	               |	ЭлектронноеПисьмоИсходящее.Текст,
	               |	ЭлектронноеПисьмоИсходящее.ТекстHTML,
	               |	ЭлектронноеПисьмоИсходящее.ТипТекста,
	               |	ЭлектронноеПисьмоИсходящее.Ссылка,
	               |	1
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО (ЭлектронноеПисьмоИсходящее.Тема ПОДОБНО ВТ.Гуид
	               |				ИЛИ ЭлектронноеПисьмоИсходящее.Текст ПОДОБНО ВТ.Гуид
	               |				ИЛИ ЭлектронноеПисьмоИсходящее.ТекстHTML ПОДОБНО ВТ.Гуид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сбор.Заявка КАК Заявка,
	               |	Сбор.Тема КАК Тема,
	               |	Сбор.Текст КАК Текст,
	               |	Сбор.ТекстHTML КАК ТекстHTML,
	               |	Сбор.ТипТекста КАК ТипТекста,
	               |	Сбор.ВхПисьмо КАК Письмо,
	               |	Сбор.Вид КАК Вид
	               |ИЗ
	               |	Сбор КАК Сбор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВхПисьмо УБЫВ
	               |ИТОГИ ПО
	               |	Заявка";  
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Заявки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Заявки.Следующий() Цикл 
		Ответы = Заявки.Выбрать(); 
		//Найдено = Ложь;
		//Согласовано = Неопределено;  
		Проверка = Новый Структура("Найдено, Согласовано", Ложь, Ложь); 
		Пока Ответы.Следующий() Цикл 
			Если Ответы.Вид = 0 Тогда 
				
				Если ЗначениеЗаполнено(Ответы.Текст) = Ложь Тогда 
					Продолжить;
				КонецЕсли;          
				НТекст 	= НРег(Ответы.Текст);
				Позиция = СтрНайти(НТекст, "согласован");
				Если не ЗначениеЗаполнено(Позиция) Тогда 
					Продолжить;
				КонецЕсли;
				Проверка.Согласовано = Истина;
				Если Позиция > 2 Тогда 
					До 		= Лев(НТекст,Позиция);
					Позиция = СтрНайти(До, "не");
					Если ЗначениеЗаполнено(Позиция) Тогда 
						Проверка.Согласовано = Ложь;
					КонецЕсли;
				КонецЕсли;
				Проверка.Найдено = Истина;
				Прервать; 
				
			ИначеЕсли Ответы.Вид = 1 Тогда 
				Проверка = ПроверитьСогласовано(Ответы.Тема);
				Если Проверка.Найдено = Истина Тогда           
					Прервать;
				КонецЕсли;
				
				Если Ответы.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст") Тогда 
					Проверка = ПроверитьСогласовано(Ответы.Текст);
				Иначе 
					Проверка = ПроверитьСогласовано(Ответы.ТекстHTML);
				КонецЕсли;
				
				Если Проверка.Найдено = Истина Тогда           
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Проверка.Найдено Тогда 
			НачатьТранзакцию(); 
			НовыйСтатус = ?(Проверка.Согласовано,ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано"),ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтказаноВСогласовании"));
			Результат 	= РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(Ответы.Заявка,НовыйСтатус);
			Если Результат.ЕстьОшибка Тогда 
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			Результат = РегистрыСведений.ЗаявкиНаСогласовании.ЗавершитьСогласование(Новый Структура("Заявка,Письмо",Ответы.Заявка,Ответы.Письмо));
			Если Результат.ЕстьОшибка Тогда 
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

Функция ПроверитьСогласовано(Текст)  
	Ответ = Новый Структура("Найдено, Согласовано", Ложь, Ложь);
	Если СтрНайти(Текст, "[APPROVED]") Тогда 
		Ответ.Найдено = Истина;
		Ответ.Согласовано = Истина;
	ИначеЕсли СтрНайти(Текст, "[REJECTED]") Тогда 
		Ответ.Найдено = Истина;
		//Согласовано = Ложь;
	КонецЕсли; 
	Возврат Ответ;
КонецФункции


Процедура ВыдатьПраваПоЗаявкам() Экспорт   
	//ТД = ТекущаяДата();
	
	Запрос = Новый Запрос;      
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СтатусыЗаявокСрезПоследних.Заявка,
	//               |	1
	//               |ИЗ
	//               |	РегистрСведений.СтатусыЗаявок.СрезПоследних КАК СтатусыЗаявокСрезПоследних
	//               |ГДЕ
	//               |	СтатусыЗаявокСрезПоследних.Статус = &СтатусВРаботе
	//               |	И РАЗНОСТЬДАТ(СтатусыЗаявокСрезПоследних.Период, &ТД, МИНУТА) >= 10";  
	//
	//Запрос.УстановитьПараметр("СтатусВРаботе", ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ВРаботе"));
	//
	//Результат = Запрос.Выполнить().Выгрузить();
	//Если Результат.Количество() = 0 = Ложь Тогда 
	//КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЗаявокСрезПоследних.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.СтатусыЗаявок.СрезПоследних КАК СтатусыЗаявокСрезПоследних
	               |ГДЕ
	               |	СтатусыЗаявокСрезПоследних.Статус = &СтатусСогласовано";
	Запрос.УстановитьПараметр("СтатусСогласовано", ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано"));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		УправлениеСтатусами.ОтработатьСогласовано(Выборка.Заявка);
	КонецЦикла;
	
	
КонецПроцедуры
