#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекСтатус 		= ПолучитьСтатус(ПараметрКоманды);
	СледующийШаг 	= УправлениеСтатусами.ПолучитьСледующийШаг(ТекСтатус);   
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", СледующийШаг);
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Истина); 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ОбработкаВводаСтатуса", ЭтотОбъект,ПараметрКоманды);

	ОткрытьФорму("Перечисление.СтатусыЗаявок.ФормаВыбора",ПараметрыФормы,ЭтотОбъект,
    ,
    ,
    ,
    ОбработкаВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбработкаВводаСтатуса(НовыйСтатус, ПараметрКоманды) Экспорт
	Если НовыйСтатус <> Неопределено Тогда
		УстановитьСтатус(ПараметрКоманды, НовыйСтатус);
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатус(Заявка)
	Возврат РегистрыСведений.СтатусыЗаявок.ПолучитьСтатус(Заявка ).Статус;
КонецФункции

&НаСервере
Процедура УстановитьСтатус(Заявка,Статус)
	РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(Заявка,Статус);
КонецПроцедуры
#КонецОбласти