#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;  
	Если ТекДанные.Свойство("Ссылка") Тогда
		ОткрытьФорму("Обработка.UniversalMechanisms.Форма.РегистрацияОбъектовМетаданных", Новый Структура("ОбъектМетаданных", ТекДанные.Ссылка));		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПроверитьПолучениеДанныхПоОбъекту(Команда)   
	
	ТекДанные = Элементы.Список.ТекущиеДанные;  
	Если ТекДанные.Свойство("Ссылка") Тогда
		ОткрытьФорму("Обработка.ПолучитьОтправитьДанныеПоОбъекту.Форма", Новый Структура("ОбъектМетаданных", ТекДанные.Ссылка)); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти