#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементов(ЭтотОбъект);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте
Процедура ЭтоМастерданныеПриИзменении(Элемент)
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;    
	
	Элементы.Источник.ТолькоПросмотр = Не Объект.ЭтоМастерданные;
	Элементы.ОбъектМетаданных.ТолькоПросмотр = Не Объект.ЭтоМастерданные;
	
КонецПроцедуры

#КонецОбласти