#Область ОбработчикиСобытийФормы
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ИнформационныеБазы") Тогда
		Возврат
	КонецЕсли; 
	
	ТекущиеГруппы = Неопределено;
	Параметры.Свойство("ТекущиеГруппы", ТекущиеГруппы);
	
	ИнформационныеБазы = Параметры.ИнформационныеБазы;
	
	НайтиСовпадающиеПоКонфигурациямГруппыДоступа(ИнформационныеБазы, ТекущиеГруппы);
					
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Массив;   
	Для Каждого Стр Из ГруппыДоступа Цикл
		Если Стр.Пометка Тогда
			Результат.Добавить(Стр.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	ДанныеЗаполнения = Новый Соответствие; 
	ДанныеЗаполнения.Вставить(Конфигурация, Результат);
	
	Закрыть(ДанныеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	
	ЗаполнитьСписокГруппДоступаПоКонфигурации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиСовпадающиеПоКонфигурациямГруппыДоступа(ИнформационныеБазы, ТекущиеПрофили)
	
	ГруппыДоступаПоКонфигурациям = Новый Соответствие;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК ИБ,
	|	ИнформационныеБазы.Конфигурация
	|ПОМЕСТИТЬ ИнфБазы
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	ИнформационныеБазы.Ссылка В (&ИнформационныеБазы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыПрофилей.Ссылка КАК Группа,
	|	ГруппыПрофилей.Конфигурация,
	|	Инфбазы.ИБ
	|ПОМЕСТИТЬ Группы
	|ИЗ
	|	Справочник.ГруппыПрофилей КАК ГруппыПрофилей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнфБазы КАК ИнфБазы
	|		ПО ГруппыПрофилей.Конфигурация = ИнфБазы.Конфигурация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыДоступаИБ.Конфигурация КАК Конфигурация,
	|	ГруппыДоступаИБ.Группа КАК ГруппаДоступа,
	|	КОЛИЧЕСТВО(ГруппыДоступаИБ.Группа) КАК ГруппаКоличество,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыДоступаИБ.ИБ) КАК ИБКоличество
	|ПОМЕСТИТЬ ГруппыДоступаПоКонфигурациям
	|ИЗ
	|	Группы КАК ГруппыДоступаИБ
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступаИБ.Конфигурация,
	|	ГруппыДоступаИБ.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформационныхБазПоКонфигурациям.Конфигурация КАК Конфигурация,
	|	ГруппыДоступаПоКонфигурациям.ГруппаДоступа КАК ГруппаДоступа
	|ИЗ
	|	ГруппыДоступаПоКонфигурациям КАК ГруппыДоступаПоКонфигурациям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГруппыДоступаПоКонфигурациям.Конфигурация КАК Конфигурация,
	|			МАКСИМУМ(ГруппыДоступаПоКонфигурациям.ИБКоличество) КАК ИБКоличество
	|		ИЗ
	|			ГруппыДоступаПоКонфигурациям КАК ГруппыДоступаПоКонфигурациям
	|		СГРУППИРОВАТЬ ПО
	|			ГруппыДоступаПоКонфигурациям.Конфигурация) КАК ИнформационныхБазПоКонфигурациям
	|		ПО ГруппыДоступаПоКонфигурациям.Конфигурация = ИнформационныхБазПоКонфигурациям.Конфигурация
	|		И ГруппыДоступаПоКонфигурациям.ИБКоличество = ИнформационныхБазПоКонфигурациям.ИБКоличество
	|ИТОГИ
	|ПО
	|	Конфигурация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыДоступаИБ.Группа КАК ГруппаДоступа,
	|	КОЛИЧЕСТВО(ГруппыДоступаИБ.Группа) КАК КоличествоГруппСОдинаковымИменем
	|ИЗ
	|	Группы КАК ГруппыДоступаИБ
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступаИБ.Группа
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ГруппыДоступаИБ.Группа) = &КоличествоИБ
	|	И КОЛИЧЕСТВО(ГруппыДоступаИБ.Группа) > 1";
	
	Запрос.УстановитьПараметр("ИнформационныеБазы", ИнформационныеБазы);
	Запрос.УстановитьПараметр("КоличествоИБ", ИнформационныеБазы.Количество());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();                                           
	
	ТекКонфигурация = Неопределено;
	
	ВыборкаКонфигурация = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	Пока ВыборкаКонфигурация.Следующий() Цикл
		
		Выборка = ВыборкаКонфигурация.Выбрать();  
		
		ТекКонфигурация = ВыборкаКонфигурация.Конфигурация;		
		Элементы.Конфигурация.СписокВыбора.Добавить(ТекКонфигурация);   	
		
		ГруппыДоступаКонфигурации = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ГруппыДоступаКонфигурации.Добавить(Выборка.ГруппаДоступа);	
		КонецЦикла; 	
		ГруппыДоступаПоКонфигурациям.Вставить(ТекКонфигурация, ГруппыДоступаКонфигурации);  
		
	КонецЦикла;	 
	      
	СовпадающиеПоВсемБазам = ПакетЗапросов[ПакетЗапросов.Количество()-1];
	Если СовпадающиеПоВсемБазам.Пустой() и ЗначениеЗаполнено(ТекКонфигурация) Тогда  
		
		Конфигурация = ТекКонфигурация;
		КэшГруппДоступаПоКонфигурациям = Новый ФиксированноеСоответствие(ГруппыДоступаПоКонфигурациям);   
		ГруппыДоступа.ЗагрузитьЗначения(КэшГруппДоступаПоКонфигурациям.Получить(Конфигурация));
		
		Если ЗначениеЗаполнено(ТекущиеПрофили) Тогда
			Для Каждого Стр Из ТекущиеПрофили Цикл
				ГруппыДоступа.НайтиПоЗначению(Стр).Пометка = Истина;		
			КонецЦикла;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ГруппыДоступаОбщие = Новый Массив;
	ВыборкаСовпадающиеПоВсемБазам = СовпадающиеПоВсемБазам.Выбрать();
	Пока ВыборкаСовпадающиеПоВсемБазам.Следующий() Цикл 
		ГруппыДоступаОбщие.Добавить(ВыборкаСовпадающиеПоВсемБазам.ГруппаДоступа);   	
	КонецЦикла;
	
	ВсеКонфигурации = Перечисления.КонфигурацииИнформационныхБаз.ПустаяСсылка();
	Элементы.Конфигурация.СписокВыбора.Добавить(ВсеКонфигурации, "Все конфигурации");
	
	ГруппыДоступаПоКонфигурациям.Вставить(ВсеКонфигурации, ГруппыДоступаОбщие);	
	КэшГруппДоступаПоКонфигурациям = Новый ФиксированноеСоответствие(ГруппыДоступаПоКонфигурациям); 
	ГруппыДоступа.ЗагрузитьЗначения(КэшГруппДоступаПоКонфигурациям.Получить(ВсеКонфигурации))
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокГруппДоступаПоКонфигурации() 
	
	ГруппыДоступа.Очистить();
	ГруппыДоступа.ЗагрузитьЗначения(КэшГруппДоступаПоКонфигурациям.Получить(Конфигурация));
	
КонецПроцедуры


#КонецОбласти
