#Область Интерфейс
Функция ЗаписатьПрофиль(Структура) Экспорт  
	Ответ = Новый Структура("Ошибка,ОписаниеОшибки,Результат", Ложь,"", Истина);
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,Структура);
	
	Попытка
		МЗ.Записать(Истина);
	Исключение   
		Ответ.Ошибка = Истина;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция ОтменитьПрофиль(Структура) Экспорт  
	Ответ = Новый Структура("Ошибка,ОписаниеОшибки,Результат", Ложь,"", Истина);
	
	ЕстьПериод = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Структура,"Период") Тогда 
		Если ЗначениеЗаполнено(Структура.Период) Тогда 
			ЕстьПериод = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПериод = Ложь Тогда 
		Структура.Вставить("Период", ТекущаяДата());
	КонецЕсли;
	
	Структура.Установлено = Ложь;
	
	Возврат ЗаписатьПрофиль(Структура);
		
КонецФункции

Функция ЗаписатьМассивПрофилей(Структура,Массив) Экспорт
	Ответ = Новый Структура("Ошибка,ОписаниеОшибки,Результат", Ложь,"", Истина);
	
	ЕстьОшибка 		= Ложь;
	МассивОшибок 	= Новый Массив;
	Для Каждого Эл Из Массив Цикл  
		Структура.Вставить("Профиль", Эл);
		ОтветЗаписи = ЗаписатьПрофиль(Структура);
		Если ОтветЗаписи.Ошибка Тогда
			ЕстьОшибка = Истина;
			МассивОшибок.Добавить(ОтветЗаписи.ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибка Тогда
		Ответ.Ошибка = Истина;  
		Ответ.ОписаниеОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьСтруктуруЗаписи() Экспорт   
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать * ИЗ РегистрСведений.ПрофилиПользователей как ВТ Где Ложь";
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат);
	
КонецФункции

#КонецОбласти