#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтеграцияКлиент.ПрочитатьНастройкиАвторизации(ИмяПользователя, Ложь, Пароль, ИспользуетсяАутентификацияОС);    

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	СохранитьНастройкиАвторизации(ИмяПользователя,
				Пароль,
				ИспользуетсяАутентификацияОС);
	Оповестить("ИзменениеНастроекАвторизации");			
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНастройкиАвторизации(ИмяПользователя, Пароль, ИспользуетсяАутентификацияОС)
	
	ИнтеграцияКлиент.СохранитьНастройкиАвторизации(
				ИмяПользователя,
				Пароль,
				ИспользуетсяАутентификацияОС);   
				
КонецПроцедуры      

#КонецОбласти