
&НаКлиенте
Процедура ПоказатьПароль(Команда) 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ПоказатьПароль","Пометка",Не Элементы.ПоказатьПароль.Пометка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Пароль", "РежимПароля", Не Элементы.ПоказатьПароль.Пометка);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Пароль", "Данные", "");
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Пароль", "Данные", "Пароль");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ИнтеграцияКлиент.ПодготовитьЗаписьКЗаписи(Запись, Пароль);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Пароль = ИнтеграцияКлиент.ПолучитьПароль(Запись);
	КонецЕсли;
КонецПроцедуры
