
&НаСервереБезКонтекста
Процедура ОбновитьСправочникНаСервере(ЭлементМассива, СписокОшибок)
	RJM_ОбщийМодуль.RJM_ОбновитьСправочникРеглЗаданияНаПроверку(ЭлементМассива, СписокОшибок);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочник(Команда)
	
	СписокОшибок = Новый Массив;	
	
	// получаем список веб сервисов
	МассивВебСервисов = ПолучитьСписокВебСервисов();
	
	Если МассивВебСервисов.Количество() > 0 Тогда
		КоличествоВебСервисов = МассивВебСервисов.Количество();
		ШагИндикатора = 100/КоличествоВебСервисов;
		ПрогрессИндикатора = 0;
		Для каждого ЭлементМассива из МассивВебСервисов Цикл
			Состояние("Получаем данные от веб сервиса (ИБ) " + ЭлементМассива, ПрогрессИндикатора);
			ОбновитьСправочникНаСервере(ЭлементМассива, СписокОшибок);		
			ПрогрессИндикатора = ПрогрессИндикатора + ШагИндикатора;
		КонецЦикла;		
	КонецЕсли;
	
	// сообщим что справочник веб сервисов пустой
	Если МассивВебСервисов.Количество() = 0 Тогда
		Сообщить("Справочник веб сервисов пуст, информация по веб сервисам (ИБ) не загружена");
	КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.Дерево.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтслеживаемоеСобытие(Команда)
	СписокВыбораЗнач = НовыйСписокВыбора();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДобавитьОтслеживаемоеСобытиеЗавершение", ЭтаФорма), СписокВыбораЗнач); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтслеживаемоеСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДобавитьСобытияДляСпискаНаСервере(Результат.Значение);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйСписокВыбора()
	
	СписокЗн = Новый СписокЗначений;
	СписокЗн.Добавить(Перечисления.RJM_СобытиеПроверки.ПроверкаНаВыполнение);
	СписокЗн.Добавить(Перечисления.RJM_СобытиеПроверки.ПроверкаНаНеИспользование);
	СписокЗн.Добавить(Перечисления.RJM_СобытиеПроверки.ПроверкаНаОшибку);
	
	Возврат СписокЗн;
	
КонецФункции

&НаСервере
Процедура ДобавитьСобытияДляСпискаНаСервере(СобытиеПроверки)
	Если Элементы.Список.ВыделенныеСтроки <> Неопределено Тогда
		Для каждого стр из Элементы.Список.ВыделенныеСтроки Цикл
			ОбъектСтроки = стр.Ссылка.ПолучитьОбъект();	
			Если ОбъектСтроки.ОтслеживатьЗадание = Ложь Тогда
				ОбъектСтроки.ОтслеживатьЗадание = Истина; //включаем отслеживание автоматом
			КонецЕсли;
			СтрокаТЧ = ОбъектСтроки.СобытияПроверки.Найти(СобытиеПроверки, "СобытиеПроверки");
			Если СтрокаТЧ = Неопределено Тогда
				СтрокаТЧ = ОбъектСтроки.СобытияПроверки.Добавить();
			КонецЕсли;
			СтрокаТЧ.СобытиеПроверки = СобытиеПроверки;
			ОбъектСтроки.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСобытияДляСпискаНаСервере(СобытиеПроверки)
	Если Элементы.Список.ВыделенныеСтроки <> Неопределено Тогда
		Для каждого стр из Элементы.Список.ВыделенныеСтроки Цикл
			ОбъектСтроки = стр.Ссылка.ПолучитьОбъект();	
			СтрокаТЧ = ОбъектСтроки.СобытияПроверки.Найти(СобытиеПроверки, "СобытиеПроверки");
			Если СтрокаТЧ <> Неопределено Тогда
				ОбъектСтроки.СобытияПроверки.Удалить(СтрокаТЧ);
			КонецЕсли;
			Если ОбъектСтроки.СобытияПроверки.Количество() = 0 Тогда
				ОбъектСтроки.ОтслеживатьЗадание = Ложь;		
			КонецЕсли;
			ОбъектСтроки.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтслеживаемоеСобытие(Команда)
	СписокВыбораЗнач = НовыйСписокВыбора();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УдалитьОтслеживаемоеСобытиеЗавершение", ЭтаФорма), СписокВыбораЗнач); 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтслеживаемоеСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УдалитьСобытияДляСпискаНаСервере(Результат.Значение);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВебСервисов()
	МассивВебСервисов = Новый Массив;
	Выборка = Справочники.RJM_ВебСервисы.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВебСервисов.Добавить(Выборка.Наименование);
	КонецЦикла;
	Возврат МассивВебСервисов;
КонецФункции
