#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьСписокИнформационныхБаз() Экспорт
	
    ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеСпискаИнформационныхБаз);   

	Справочники.ИнформационныеБазы.ОбновитьСписокИнформационныхБаз();	
	
КонецПроцедуры

// Сопоставляет поля в новые реквизиты регистра. база и сервер из Строки в Ссылочные типы. 
//
Процедура СопоставитьПоляДляБазыИСервераSQL() Экспорт   
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.СопоставлениеПолейРегистраНагрузкаSQLСерверов);   
	РегистрыСведений.НагрузкаSQLСерверов.СопоставитьПоляДляБазыИСервераSQL();
КонецПроцедуры   

// Сопоставляет базу данных на сервере sql с информационной базой на сервере приложений 1с
//
Процедура СопоставитьБазуДанныхИИнформационнуюБазу() Экспорт   
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.МониторингБазДанных);   
	Справочники.БазыДанных.СопоставитьБазуДанныхИИнформационнуюБазу();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Преобразует массив структур в таблицу значений.
// Все структуры должны содеражать одинаковые поля.
// Тип колонок устанавливается по значениям в массиве.
// Проверка полноты заполнения полей в структурах массива
// не производится.
//
// Параметры:
//  МассивСтруктур - Массив(Структура) - массив структур для преобразования.
// 
// Возвращаемое значение:
//   ТаблицаЗначений - колонки соотвествуют полям из самой первой структуры.
//		Строки заполнены созданы и заполнены из всех структур массива.
//
Функция МассивВТаблицуЗначений(МассивСтруктур) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	Если МассивСтруктур.Количество() > 0 Тогда 
		ДобавитьКолонкиТаблицыЗначенийИзСтруктуры(ТЗ, МассивСтруктур);
		Для Каждого ЗначенияСтроки Из МассивСтруктур Цикл
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияСтроки);
		КонецЦикла;
	КонецЕсли;
	Возврат ТЗ;
КонецФункции

// Процедура - Добавить колонки таблицы значений из структуры.
// Тип колонки - либо объединение типов значений в ней,
// либо, если значений нет, то это Число.
//
// Параметры:
//  Таблица - ТаблицаЗначений - таблица значений для добавления
//		колонок.
//  МассивСтруктур - Массив(Структура) - из нее берутся имена колонок.
//
Процедура ДобавитьКолонкиТаблицыЗначенийИзСтруктуры(
											Таблица, 
											МассивСтруктур) Экспорт
	ТипыКолонок = Новый Соответствие;
	Для Каждого ЗначенияСтроки Из МассивСтруктур Цикл
		Для Каждого Колонка Из ЗначенияСтроки Цикл
			Значение = Колонка.Значение;
			Если Значение <> Неопределено 
					И ЗначениеЗаполнено(Значение) Тогда
				ИмяКолонки = Колонка.Ключ;
				мТипов = ТипыКолонок[ИмяКолонки];
				Если мТипов = Неопределено Тогда
					мТипов = Новый Массив;
					ТипыКолонок[ИмяКолонки] = мТипов;
				КонецЕсли;
				мТипов.Добавить(ТипЗнч(Колонка.Значение));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого Колонка Из МассивСтруктур[0] Цикл
		ИмяКолонки = Колонка.Ключ;
		мТипов = ТипыКолонок[ИмяКолонки];
		Если мТипов = Неопределено ИЛИ мТипов.Количество() = 0 Тогда
			мТипов = ОбщегоНазначенияКлиентСерверCDM.ЗначениеВМассиве(
				Тип("Число"));
		КонецЕсли;
		ОписаниеТипаКолонки = Новый ОписаниеТипов(мТипов);
		Таблица.Колонки.Добавить(ИмяКолонки, ОписаниеТипаКолонки);
	КонецЦикла;
КонецПроцедуры 

#КонецОбласти