#Область Интерфейс
Функция ПолучитьЗначенияПоУмолчанию(ВидРассылки = Неопределено) Экспорт
	Ответ = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.Пользователь КАК Пользователь,
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты,
	               |	УчастникиПочтовойРассылки.ВидРассылки КАК ВидРассылки,
	               |	УчастникиПочтовойРассылки.ПоУмолчанию КАК ПоУмолчанию,
	               |	УчастникиПочтовойРассылки.Роль КАК Роль
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Ответ = Запрос.Выполнить().Выгрузить();
	Возврат Ответ;
КонецФункции

Функция ПолучитьСогласующих(ВидРассылки = Неопределено) Экспорт
	Ответ = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки
	               |	И УчастникиПочтовойРассылки.Роль = &Роль
	               |	И УчастникиПочтовойРассылки.Выключен = ЛОЖЬ";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Роль", ПредопределенноеЗначение("Перечисление.РолиРассылки.Согласующий"));	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	//Ответ = Результат.ВыгрузитьКолонку("АдерсЭлПочты");
	Ответ.Добавить("Nikolay.Ivanov@phoenixtrading.ltd");
	//Ответ.Вставить("lyudmila.mirchu@phoenixtrading.ltd");
	Возврат Ответ;
КонецФункции

Функция ПолучитьНаблюдателей(ВидРассылки = Неопределено) Экспорт
	Ответ = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки
	               |	И УчастникиПочтовойРассылки.Роль = &Роль
	               |	И УчастникиПочтовойРассылки.Выключен = ЛОЖЬ";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Роль", ПредопределенноеЗначение("Перечисление.РолиРассылки.Наблюдатель"));	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	Ответ = Результат.ВыгрузитьКолонку("АдерсЭлПочты");
	//Ответ = Запрос.Выполнить().Выгрузить();
	Ответ.Добавить("Nikolay.Ivanov@phoenixtrading.ltd");
	//Ответ.Вставить("lyudmila.mirchu@phoenixtrading.ltd");
	Возврат Ответ;
КонецФункции

#КонецОбласти