	 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РегистрацияПользователей(Команда)
	ОткрытьФорму("Обработка.UniversalMechanisms.Форма.РегистрацияПользователей");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключения(Команда)
	ОткрытьФорму("Обработка.UniversalMechanisms.Форма.Авторизация");
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияОбъектов(Команда)
	ОткрытьФорму("Обработка.UniversalMechanisms.Форма.РегистрацияОбъектовМетаданных");
КонецПроцедуры


&НаКлиенте
Процедура РегистрацияОтчетовИОбработок(Команда)
	ОткрытьФорму("Обработка.UniversalMechanisms.Форма.РегистрацияОтчетовИОбработок");
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПравилОбмена(Команда)
	ОткрытьФорму("Обработка.UniversalMechanisms.Форма.РегистрацияПравилОбмена");
КонецПроцедуры


#КонецОбласти

