#Область ПрограммныйИнтерфейс
Функция УстановитьСтатус(Заявка, НовыйСтатус) Экспорт  
	Ответ = Новый Структура("Результат, ОписаниеОшибки, ЕстьОшибка", Ложь, "", Ложь);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка = Заявка;
	МенеджерЗаписи.Статус = НовыйСтатус;
	МенеджерЗаписи.Автор  = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МенеджерЗаписи.Записать();
		Ответ.Результат = Истина;  
		Результат = УправлениеСтатусами.ВыполнитьПостобработчик(Заявка, НовыйСтатус);
	Исключение
		Ответ.Результат 	 = Ложь;
		Ответ.ЕстьОшибка 	 = Истина;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если Ответ.Результат = Истина Тогда 
		МассивНаблюдателей = РегистрыСведений.УчастникиПочтовойРассылки.ПолучитьНаблюдателей(ПредопределенноеЗначение("Перечисление.ВидыРассылок.ЗаявкаНаВыдачуПрав"));
		МассивИзЗаявки = Справочники.ЗаявкиНаПредоставлениеДоступа.ПолучитьНаблюдателейИзЗаявки(Заявка);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНаблюдателей, МассивИзЗаявки);
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНаблюдателей);
		
		СтруктураПисьма = Справочники.ЗаявкиНаПредоставлениеДоступа.ПолучитьСтруктуруПисьма();
		СтруктураПисьма.МассивАдресов 	= МассивНаблюдателей;
		СтруктураПисьма.ШаблонТема 		= "Заявка на предоставление доступа {Код} от {ДатаЗаявки} изменение статуса";
		СтруктураПисьма.ШаблонТело 		= "Заявка {Код} от {ДатаЗаявки} изменение статуса {Статус}";
		СтруктураПисьма.ДопПараметры 	= Новый Структура("Статус", НовыйСтатус);
		
		Справочники.ЗаявкиНаПредоставлениеДоступа.ОтправитьПисьмо(Заявка, СтруктураПисьма);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция УстановитьСтатусы(Заявки, НовыйСтатус) Экспорт 
	Ответ  		= Новый Структура("Результат,Ошибки, ЕстьОшибка", Неопределено, Неопределено, Ложь );
	Результат 	= Новый Соответствие;           
	Ошибки 		= Новый Соответствие;            
	
	Для Каждого Эл Из Заявки Цикл 
		РезультатЗаписи = УстановитьСтатус(Эл, НовыйСтатус);
		Если РезультатЗаписи.ЕстьОшибка Тогда  
			Ошибки.Вставить(Эл, РезультатЗаписи.ОписаниеОшибки);
		Иначе 
			Результат.Вставить(Эл, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Ответ.Вставить("Результат", Результат);
	Если ЗначениеЗаполнено(Ошибки) Тогда 
		Ответ.Вставить("Ошибки", Ошибки);
		Ответ.ЕстьОшибки = Истина;
	КонецЕсли;
		
	Возврат Ответ;
КонецФункции

Функция ПолучитьСтатус(Заявка, Дата = Неопределено) Экспорт
	Ответ  = Новый Структура("Статус,Автор" );
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатусыЗаявокСрезПоследних.Автор,
	|	СтатусыЗаявокСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыЗаявок.СрезПоследних(&Дата, Заявка = &Заявка) КАК СтатусыЗаявокСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата );
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Результат = Запрос.Выполнить();
	Если  Результат.Пустой() Тогда
		Ответ.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Создано");
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
			
	Возврат Ответ;
	//Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру();
КонецФункции

Функция ПолучитьСтатусыЗаявок(Заявки, Дата = Неопределено) Экспорт
	Ответ  = Новый Структура("Статусы" );
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка КАК Заявка
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	Справочник.ЗаявкиНаПредоставлениеДоступа КАК ЗаявкиНаПредоставлениеДоступа
	               |ГДЕ
	               |	ЗаявкиНаПредоставлениеДоступа.Ссылка В(&Заявки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СтатусыЗаявокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Создано)) КАК Статус,
	               |	Вт.Заявка КАК Заявка
	               |ИЗ
	               |	Вт КАК Вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявок.СрезПоследних(&Дата, ) КАК СтатусыЗаявокСрезПоследних
	               |		ПО Вт.Заявка = СтатусыЗаявокСрезПоследних.Заявка";
	Запрос.УстановитьПараметр("Дата", Дата );
	Запрос.УстановитьПараметр("Заявка", Заявки);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	Статусы = Новый Соответствие;
	Пока Результат.Следующий() Цикл 
		Статусы.Вставить(Результат.Заявка, Результат.Статус);
	КонецЦикла;
	
	Ответ.Статусы = Статусы;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьЗаявкиПоСтатусу(Статус, Дата = Неопределено) Экспорт
	//Ответ  = Новый Структура("Статусы" );
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЗаявокСрезПоследних.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.СтатусыЗаявок.СрезПоследних(&Дата, ) КАК СтатусыЗаявокСрезПоследних
	               |ГДЕ
	               |	СтатусыЗаявокСрезПоследних.Статус = &Статус";
	Запрос.УстановитьПараметр("Дата", Дата );
	Запрос.УстановитьПараметр("Статус", Статус);
	
	Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");; 
	
	Возврат Ответ;
КонецФункции

#КонецОбласти