#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ЗаписатьРезультат(Параметры, ТекстОшибки = "") Экспорт
	
	РезультатыОбработкиДанных = СоздатьМенеджерЗаписи();   
	РезультатыОбработкиДанных.Идентификатор = Параметры.Идентификатор;
	РезультатыОбработкиДанных.ВремяИнициации = Параметры.ВремяИнициации;  
	
	РезультатыОбработкиДанных.ОбработчикРезультата = Параметры.ОбработчикРезультата; 
	РезультатыОбработкиДанных.Обработано = Не ЗначениеЗаполнено(ТекстОшибки); 
	РезультатыОбработкиДанных.ТекстОшибки = ТекстОшибки;
	
	РезультатыОбработкиДанных.Записать(Истина);
				
КонецПроцедуры


#КонецОбласти

#КонецЕсли
