#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ДобавитьОповещение(Параметры) Экспорт
	
	Оповещение = СоздатьМенеджерЗаписи();   
	Оповещение.Идентификатор = Параметры.Идентификатор;
	Оповещение.ВремяИнициации = Параметры.ВремяИнициации;
	
	Оповещение.Тема = Параметры.Тема;
	Оповещение.Сообщение = Параметры.Сообщение;
	Оповещение.ТипТекста = Параметры.ТипТекста;
	Оповещение.Получатели = Параметры.Получатели;
	Если ЗначениеЗаполнено(Параметры.РасширениеВложения) Тогда
		Оповещение.Вложение = Параметры.Вложение;
		Оповещение.РасширениеВложения = Параметры.РасширениеВложения; 
		Оповещение.ИмяФайлаВложения = Параметры.ИмяФайлаВложения;
	КонецЕсли;
			
	Оповещение.Записать(Истина);
				
КонецПроцедуры

Процедура ЗаписатьРезультатОтправкиОповещения(Параметры) Экспорт
	
	Оповещение = СоздатьМенеджерЗаписи();   
	Оповещение.Идентификатор = Параметры.Идентификатор;
	Оповещение.ВремяИнициации = Параметры.ВремяИнициации;
	Оповещение.Прочитать(); 			
	
	Если Оповещение.Выбран() Тогда
		Если Параметры.Свойство("ТекстОшибки") И ЗначениеЗаполнено(Параметры.ТекстОшибки) Тогда
			Оповещение.Отправлено  = Ложь;
			Оповещение.ТекстОшибки = Параметры.ТекстОшибки; 
		Иначе
			Оповещение.Отправлено  = Истина;
			Оповещение.ТекстОшибки = "";	
		КонецЕсли;
		Оповещение.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
